<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,5,64,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_2114" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="0" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_2117" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="16" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_2120" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="32" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/Slice_output_0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="onnx::Conv_236" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 1, 3, 3" offset="48" size="1728" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_236">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_64" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1776" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/RGB_Network/RGB_Network.0/Conv3DBlock/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.0/Conv3DBlock/activation/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="onnx::Conv_239" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 1, 1" offset="1840" size="3072" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_239">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_80" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="4912" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.3/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/RGB_Network/RGB_Network.0/Conv3DBlock/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.0/Conv3DBlock/activation_1/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.6/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2, 2" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" kernel="1, 2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.0/Conv3DBlock/Conv3DBlock.6/MaxPool_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx::Conv_242" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 3, 3" offset="4976" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_242">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_97" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="14192" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/RGB_Network/RGB_Network.1/Conv3DBlock/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.1/Conv3DBlock/activation/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="onnx::Conv_245" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 1, 1" offset="14256" size="3072" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_245">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_113" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="17328" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.3/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/RGB_Network/RGB_Network.1/Conv3DBlock/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.1/Conv3DBlock/activation_1/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.6/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2, 2" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" kernel="1, 2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.1/Conv3DBlock/Conv3DBlock.6/MaxPool_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="onnx::Conv_248" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 1, 3, 3" offset="17392" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_248">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_130" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1, 1" offset="35824" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/RGB_Network/RGB_Network.2/Conv3DBlock/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.2/Conv3DBlock/activation/Relu_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="onnx::Conv_251" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 1, 1" offset="35952" size="12288" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_251">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_146" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1, 1" offset="48240" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.3/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/RGB_Network/RGB_Network.2/Conv3DBlock/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.2/Conv3DBlock/activation_1/Relu_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.6/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2, 2" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" kernel="1, 2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.2/Conv3DBlock/Conv3DBlock.6/MaxPool_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="onnx::Conv_254" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 3, 3" offset="48368" size="36864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_254">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_163" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1, 1" offset="85232" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/RGB_Network/RGB_Network.3/Conv3DBlock/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.3/Conv3DBlock/activation/Relu_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="onnx::Conv_257" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 1, 1" offset="85360" size="12288" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_257">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>31</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_179" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1, 1" offset="97648" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>31</dim>
					<dim>31</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.3/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>31</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/RGB_Network/RGB_Network.3/Conv3DBlock/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>31</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.3/Conv3DBlock/activation_1/Relu_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>31</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.6/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2, 2" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" kernel="1, 2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>31</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/RGB_Network/RGB_Network.3/Conv3DBlock/Conv3DBlock.6/MaxPool_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_2126" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="16" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_2129" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="97776" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_2132" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="32" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/Slice_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="onnx::Conv_260" type="Const" version="opset1">
			<data element_type="f32" shape="16, 2, 1, 3, 3" offset="97792" size="1152" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_260">
					<dim>16</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_201" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="98944" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/activation/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::Conv_263" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 1, 1" offset="99008" size="3072" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_263">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_217" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="102080" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.3/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/activation_1/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.6/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2, 2" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" kernel="1, 2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>226</dim>
					<dim>226</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.0/Conv3DBlock/Conv3DBlock.6/MaxPool_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="onnx::Conv_266" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 3, 3" offset="102144" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_266">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>66</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_234" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="111360" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/activation/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Conv_269" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 1, 1" offset="111424" size="3072" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_269">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Reshape_250" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="114496" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.3/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/activation_1/Relu_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.6/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2, 2" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" kernel="1, 2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>115</dim>
					<dim>115</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.1/Conv3DBlock/Conv3DBlock.6/MaxPool_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="onnx::Conv_272" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 1, 3, 3" offset="114560" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_272">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>68</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_267" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1, 1" offset="132992" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/activation/Relu_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="onnx::Conv_275" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 1, 1" offset="133120" size="12288" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_275">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>57</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_283" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1, 1" offset="145408" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.3/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/activation_1/Relu_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.6/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 2, 2" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" kernel="1, 2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>59</dim>
					<dim>59</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.2/Conv3DBlock/Conv3DBlock.6/MaxPool_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="onnx::Conv_278" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 3, 3" offset="145536" size="36864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_278">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/OptFlow_Network/OptFlow_Network.3/Conv3DBlock/Conv3DBlock.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>70</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_300" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1, 1" offset="182400" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/OptFlow_Network/OptFlow_Network.3/Conv3DBlock/Conv3DBlock.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/OptFlow_Network/OptFlow_Network.3/Conv3DBlock/Conv3DBlock.0/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/OptFlow_Network/OptFlow_Network.3/Conv3DBlock/activation/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/OptFlow_Network/OptFlow_Network.3/Conv3DBlock/activation/Sigmoid_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx::Conv_281" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 1, 1" offset="182528" size="12288" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_281">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/OptFlow_Network/OptFlow_Network.3/Conv3DBlock/Conv3DBlock.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="1, 1, 1" pads_end="1, 1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>29</dim>
					<dim>29</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
